package com.akk.common.utils;

import java.io.UnsupportedEncodingException;
import java.text.ParseException;
import java.text.SimpleDateFormat;
import java.util.Date;
import java.util.Random;

public class StringUtil {
	
	/**
	 * ×Ö·û´®×ªÈÕÆÚ
	 * @Title: strToInteger 
	 * @Description: TODO
	 * @param str
	 * @return
	 * @return: Integer
	 */
	public  static Integer strToInteger(String str) {
		return Integer.parseInt(str);
	}
	
	public  static Integer isNumber(String str) {
		return Integer.parseInt(str);
	}
	
	/**
	 * ×Ö·û´®×ªÈÕÆÚ
	 * @Title: strToDate 
	 * @Description: TODO
	 * @param str
	 * @return
	 * @return: Date
	 */
	public static Date strToDate(String str) {
		
		SimpleDateFormat df = new SimpleDateFormat("yyyyMMdd");
		try {
		return	df.parse(str);
		} catch (ParseException e) {
			e.printStackTrace();
		}
		return null;
		
	}
	
	
	/**
	 * 
	 * @Title: split 
	 * @Description: TODO
	 * @param strs  ×Ö·û´®
	 * @param chars  ÇĞ¸îµÄ×Ö·ûÖµ
	 * @return
	 * @return: String[]
	 */
	public static String[] split(String strs,String chars) {
		
		
	    
	    return strs.split(chars);
		
	}
	
	
	
	
	// ·½·¨1£ºÅĞ¶ÏÔ´×Ö·û´®ÊÇ·ñÓĞÖµ£¬¿ÕÒıºÅ(¿Õ°××Ö·û´®)Ò²ËãÃ»Öµ (5·Ö)
	public static boolean hasLength(String src) {

		return null != src && src.length() > 0;

	}

	// ·½·¨2£ºÅĞ¶ÏÔ´×Ö·û´®ÊÇ·ñÓĞÖµ£¬¿ÕÒıºÅ(¿Õ°××Ö·û´®)ºÍ¿Õ¸ñÒ²ËãÃ»Öµ (5·Ö)
	public static boolean hasText(String src) {

		return null != src && src.trim().length() > 0;
	}

	// ·µ»ØÒ»¸öÖĞÎÄ
	public static String randomChineseString() {

		Random r = new Random();
		// 40869 ºº×Ó×îºóÒ»¸ö±àÂë 19968:µÚÒ»¸ö±àÂë
		int x = r.nextInt(40869 - 19968 + 1) + 19968;
		String str = (char) x + "";
		try {
			// ·µ»Ø¼òµ¥ÖĞÎÄ
			if (str.equals(new String(str.getBytes("GB2312"), "GB2312"))) {
				return str;
			}
		} catch (UnsupportedEncodingException e) {
			e.printStackTrace();
		}
		return randomChineseString();
	}
	
	/**
	 *
	 * @Title: randomChineseString
	 * @Description: ·µ»ØÖ¸¶¨³¤¶ÈµÄÖĞÎÄ
	 * @param length
	 * @return
	 * @return: String
	 */
	public static String randomChineseString(int length) {
		StringBuilder sb = new StringBuilder();
		
		
		for (int i = 0; i < length; i++) {
			sb.append(randomChineseString());
		}
		return sb.toString();

	}


	// ·½·¨4£º·µ»ØÖĞÎÄĞÕÃû£¬±ØĞëÒÔÕæÊµĞÕ¿ªÍ·£¬°Ù¼ÒĞÕÔÚ¡°Áù¡¢¸½°Ù¼ÒĞÕ¡±Àï£¬ÃûÊ¹ÓÃ1-2¸öËæ»úºº×Ö(8·Ö)£¬ÄÚ²¿µ÷ÓÃrandomChineseString()·½·¨(3·Ö)¡£·µ»ØÊ¾Àı£º¡°ÁõÑ½±»¡±¡¢¡°Å·Ñô¼°Îª¡±
	public static String generateChineseName() {

		String[] surname = { "ÕÔ", "Ç®", "Ëï", "Àî", "ÖÜ", "Îâ", "Ö£", "Íõ", "·ë", "³Â", "ñÒ", "ÎÀ", "½¯", "Éò", "º«", "Ñî", "Öì", "ÇØ",
				"ÓÈ", "Ğí", "ºÎ", "ÂÀ", "Ê©", "ÕÅ", "¿×", "²Ü", "ÑÏ", "»ª", "½ğ", "Îº", "ÌÕ", "½ª", "Æİ", "Ğ»", "×Ş", "Ó÷", "°Ø", "Ë®", "ñ¼",
				"ÕÂ", "ÔÆ", "ËÕ", "ÅË", "¸ğ", "ŞÉ", "·¶", "Åí", "ÀÉ", "Â³", "Î¤", "²ı", "Âí", "Ãç", "·ï", "»¨", "·½", "Óá", "ÈÎ", "Ô¬", "Áø",
				"Ûº", "±«", "Ê·", "ÌÆ", "·Ñ", "Á®", "á¯", "Ñ¦", "À×", "ºØ", "Äß", "ÌÀ", "ëø", "Òó", "ÂŞ", "±Ï", "ºÂ", "Úù", "°²", "³£", "ÀÖ",
				"ÓÚ", "Ê±", "¸µ", "Æ¤", "±å", "Æë", "¿µ", "Îé", "Óà", "Ôª", "²·", "¹Ë", "ÃÏ", "Æ½", "»Æ", "ºÍ", "ÄÂ", "Ïô", "Òü", "Ò¦", "ÉÛ",
				"Õ¿", "Íô", "Æî", "Ã«", "Óí", "µÒ", "Ã×", "±´", "Ã÷", "ê°", "¼Æ", "·ü", "³É", "´÷", "Ì¸", "ËÎ", "Ã©", "ÅÓ", "ĞÜ", "¼Í", "Êæ",
				"Çü", "Ïî", "×£", "¶­", "Áº", "¶Å", "Èî", "À¶", "ãÉ", "Ï¯", "¼¾", "Âé", "Ç¿", "¼Ö", "Â·", "Â¦", "Î£", "½­", "Í¯", "ÑÕ", "¹ù",
				"Ã·", "Ê¢", "ÁÖ", "µó", "ÖÓ", "Ğì", "Çñ", "Âæ", "¸ß", "ÏÄ", "²Ì", "Ìï", "·®", "ºú", "Áè", "»ô", "Óİ", "Íò", "Ö§", "¿Â", "êÃ",
				"¹Ü", "Â¬", "Äª", "¾­", "·¿", "ôÃ", "çÑ", "¸É", "½â", "Ó¦", "×Ú", "¶¡", "Ğû", "êÚ", "µË", "Óô", "µ¥", "º¼", "ºé", "°ü", "Öî",
				"×ó", "Ê¯", "´Ş", "¼ª", "Å¥", "¹¨", "³Ì", "ïú", "ĞÏ", "»¬", "Åá", "Â½", "ÈÙ", "ÎÌ", "Ü÷", "Ñò", "ÓÚ", "»İ", "Õç", "Çú", "¼Ò",
				"·â", "ÜÇ", "ôà", "´¢", "½ù", "¼³", "Úû", "ÃÓ", "ËÉ", "¾®", "¶Î", "¸»", "Î×", "ÎÚ", "½¹", "°Í", "¹­", "ÄÁ", "Úó", "É½", "¹È",
				"³µ", "ºî", "åµ", "Åî", "È«", "Û­", "°à", "Ñö", "Çï", "ÖÙ", "ÒÁ", "¹¬", "Äş", "³ğ", "èï", "±©", "¸Ê", "î×", "À÷", "ÈÖ", "×æ",
				"Îä", "·û", "Áõ", "¾°", "Õ²", "Êø", "Áú", "Ò¶", "ĞÒ", "Ë¾", "ÉØ", "Û¬", "Àè", "¼»", "äß", "Ó¡", "ËŞ", "°×", "»³", "ÆÑ", "Û¢",
				"´Ó", "¶õ", "Ë÷", "ÏÌ", "¼®", "Àµ", "×¿", "İş", "ÍÀ", "ÃÉ", "³Ø", "ÇÇ", "Òõ", "Óô", "ñã", "ÄÜ", "²Ô", "Ë«", "ÎÅ", "İ·", "µ³",
				"µÔ", "Ì·", "¹±", "ÀÍ", "åÌ", "¼§", "Éê", "·ö", "¶Â", "È½", "Ô×", "Ûª", "Óº", "È´", "è³", "É£", "¹ğ", "å§", "Å£", "ÊÙ", "Í¨",
				"±ß", "ìè", "Ñà", "¼½", "ÆÖ", "ÉĞ", "Å©", "ÎÂ", "±ğ", "×¯", "êÌ", "²ñ", "öÄ", "ÑÖ", "³ä", "Ä½", "Á¬", "Èã", "Ï°", "»Â", "°¬",
				"Óã", "Èİ", "Ïò", "¹Å", "Ò×", "É÷", "¸ê", "ÁÎ", "â×", "ÖÕ", "ôß", "¾Ó", "ºâ", "²½", "¶¼", "¹¢", "Âú", "ºë", "¿ï", "¹ú", "ÎÄ",
				"¿Ü", "¹ã", "Â»", "ãÚ", "¶«", "Å·", "ì¯", "ÎÖ", "Àû", "Îµ", "Ô½", "Ùç", "Â¡", "Ê¦", "¹®", "ØÇ", "Äô", "êË", "¹´", "°½", "ÈÚ",
				"Àä", "ö¤", "ĞÁ", "ãÛ", "ÄÇ", "¼ò", "ÈÄ", "¿Õ", "Ôø", "Îã", "É³", "Ø¿", "Ñø", "¾Ï", "Ğë", "·á", "³²", "¹Ø", "Øá", "Ïà", "²é",
				"ºó", "¾£", "ºì", "ÓÎ", "Û£", "óÃ", "È¨", "åÖ", "¸Ç", "Òæ", "»¸", "¹«", "Øë", "¶½", "ÔÀ", "Ë§", "çÃ", "¿º", "¿ö", "àC", "ÓĞ",
				"ÇÙ", "¹é", "º£", "½ú", "³ş", "ãÆ", "·¨", "Èê", "Û³", "Í¿", "ÇÕ", "ÉÌ", "Ä²", "ÙÜ", "Ù¦", "²®", "ÉÍ", "Ä«", "¹ş", "ÚÛ", "óò",
				"Äê", "°®", "Ñô", "Ù¡", "ÑÔ", "¸£", "ÄÏ", "»ğ", "Ìú", "³Ù", "Æá", "¹Ù", "Ùş", "Õæ", "Õ¹", "·±", "Ì´", "¼À", "ÃÜ", "¾´", "½Ò",
				"Ë´", "Â¥", "Êè", "Ã°", "»ë", "Ö¿", "½º", "Ëæ", "¸ß", "¸Ş", "Ô­", "ÖÖ", "Á·", "ÃÖ", "²Ö", "íõ", "å¿", "ñû", "°¢", "ÃÅ", "ã¢",
				"À´", "ôë", "ÕÙ", "ÒÇ", "·ç", "½é", "¾Ş", "Ä¾", "¾©", "ºü", "Û¨", "»¢", "Ã¶", "¿¹", "´ï", "è½", "ÜÉ", "ÕÛ", "Âó", "Çì", "¹ı",
				"Öñ", "¶Ë", "ÏÊ", "»Ê", "ØÁ", "ÀÏ", "ÊÇ", "ÃØ", "³©", "Ú÷", "»¹", "±ö", "ãÌ", "¹¼", "×İ", "‚G", "ÍòÙ¹", "Ë¾Âí", "ÉÏ¹Ù", "Å·Ñô",
				"ÏÄºî", "Öî¸ğ", "ÎÅÈË", "¶«·½", "ºÕÁ¬", "»Ê¸¦", "ÑòÉà", "Î¾³Ù", "¹«Ñò", "å£Ì¨", "¹«Ò±", "×ÚÕı", "å§Ñô", "´¾ÓÚ", "µ¥ÓÚ", "Ì«Êå", "ÉêÍÀ",
				"¹«Ëï", "ÖÙËï", "ĞùÔ¯", "Áîºü", "ÖÓÀë", "ÓîÎÄ", "³¤Ëï", "Ä½Èİ", "ÏÊÓÚ", "ãÌÇğ", "Ë¾Í½", "Ë¾¿Õ", "Ø£¹Ù", "Ë¾¿Ü", "ÄÏÃÅ", "ºôÑÓ", "×Ó³µ",
				"ò§Ëï", "¶ËÄ¾", "Î×Âí", "¹«Î÷", "Æáµñ", "³µÕı", "ÈÀæá", "¹«Á¼", "ÍØ°Ï", "¼Ğ¹È", "Ô×¸¸", "¹ÈÁº", "¶Î¸É", "°ÙÀï", "¶«¹ù", "Î¢Éú", "ÁºÇğ",
				"×óÇğ", "¶«ÃÅ", "Î÷ÃÅ", "ÄÏ¹¬", "µÚÎå", "¹«ÒÇ", "¹«³Ë", "Ì«Ê·", "ÖÙ³¤", "ÊåËï", "ÇüÍ»", "¶ûÖì", "¶«Ïç", "ÏàÀï", "ºúÄ¸", "Ë¾³Ç", "ÕÅÁÎ",
				"ÓºÃÅ", "ÎãÇğ", "ºØÀ¼", "ôëÎã", "ÎİÂ®", "¶À¹Â", "ÄÏ¹ù", "±±¹¬", "ÍõËï" };

		// ĞÕÃû == ĞÕ +Ãû

		Random r = new Random();
		// Ëæ»ú»ñÈ¡ĞÕÊÏ
		String str1 = surname[r.nextInt(surname.length)];

		String str2 = "";
		if (r.nextBoolean()) {// Ò»¸öÖĞÎÄ
			str2 = randomChineseString(1);
		} else {// Á½¸öÖĞÎÄ
			str2 = randomChineseString(2);
		}
         
		return str1 + str2;

	}

	

}
